[
    {
        "doc_id": 0,
        "prompt_0": "People think Samantha is embarassed, because Samantha made snide comments about the shirt Rebecca was wearing.",
        "prompt_1": "People think Rebecca is embarassed, because Samantha made snide comments about the shirt Rebecca was wearing.",
        "logit_0": -63.25,
        "truth": 1,
        "logit_1": -61.6875,
        "acc": "True"
    },
    {
        "doc_id": 1,
        "prompt_0": "For her birthday gifts, Sarah was upset with the pearls, but felt the opposite about the rings she received. The pearls were fancier.",
        "prompt_1": "For her birthday gifts, Sarah was upset with the pearls, but felt the opposite about the rings she received. The rings were fancier.",
        "logit_0": -15.28125,
        "truth": 1,
        "logit_1": -14.1484375,
        "acc": "True"
    },
    {
        "doc_id": 2,
        "prompt_0": "Erin knew the perfect gift for the wedding  shower, but Samantha had to do some research, because Erin was slightly acquainted with the bride.",
        "prompt_1": "Erin knew the perfect gift for the wedding  shower, but Samantha had to do some research, because Samantha was slightly acquainted with the bride.",
        "logit_0": -35.96875,
        "truth": 1,
        "logit_1": -37.90625,
        "acc": "False"
    },
    {
        "doc_id": 3,
        "prompt_0": "I wanted to build a bathroom on the third floor of the house but I couldn't because the bathroom would be too full.",
        "prompt_1": "I wanted to build a bathroom on the third floor of the house but I couldn't because the floor would be too full.",
        "logit_0": -15.984375,
        "truth": 1,
        "logit_1": -15.796875,
        "acc": "True"
    },
    {
        "doc_id": 4,
        "prompt_0": "At their high school's homecoming dance, Natalie stayed on the floor for the slow dance while Maria got food during it, because Natalie currently had a significant other.",
        "prompt_1": "At their high school's homecoming dance, Natalie stayed on the floor for the slow dance while Maria got food during it, because Maria currently had a significant other.",
        "logit_0": -26.65625,
        "truth": 0,
        "logit_1": -25.203125,
        "acc": "False"
    },
    {
        "doc_id": 5,
        "prompt_0": "So Betty ignores Google to search for information because Betty trusts in it and Cynthia doesn't.",
        "prompt_1": "So Cynthia ignores Google to search for information because Betty trusts in it and Cynthia doesn't.",
        "logit_0": -85.3125,
        "truth": 1,
        "logit_1": -81.625,
        "acc": "True"
    }
]